# ðŸš¢ Titanic Dataset: Cleaning & Inspection
This notebook demonstrates how to use Pandas for exploring and cleaning a dataset using the famous Titanic dataset.

## ðŸ“¥ Step 1: Load the Dataset

In [1]:
import pandas as pd

# Load the dataset (ensure it's available in your environment or update the path)
url = 'https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv'
df = pd.read_csv(url)
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [ ]:
# Data Analysis - Dependent Variable - Survi, independent variable - all

## ðŸ§¾ Step 2: Basic Info & Structure

In [2]:
df.shape

(891, 12)

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [6]:
df.describe(include='object')

                           Name   Sex  Ticket    Cabin Embarked
count                       891   891     891      204      889
unique                      891     2     681      147        3
top     Braund, Mr. Owen Harris  male  347082  B96 B98        S
freq                          1   577       7        4      644

## ðŸ§¹ Step 3: Handling Missing Values

In [10]:
# Check missing values
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [8]:
df['Age'].median()

28.0

In [9]:
# Fill missing 'Age' with median
df['Age'].fillna(df['Age'].median(), inplace=True)

/var/folders/19/8bk5lhzj2b7crktgv8zcc9b00000gn/T/ipykernel_3875/1672961352.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Age'].fillna(df['Age'].median(), inplace=True)

In [12]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [11]:
# Drop rows with missing 'Embarked'
df.dropna(subset=['Embarked'], inplace=True)

## ðŸ”Ž Step 4: Feature Exploration

In [14]:
df['Embarked']

0      S
1      C
2      S
3      S
4      S
      ..
886    S
887    S
888    S
889    C
890    Q
Name: Embarked, Length: 889, dtype: object

In [17]:
df['Pclass'].unique()

array([3, 1, 2])

In [15]:
# Unique values in categorical features
print(df['Sex'].unique())
print(df['Embarked'].unique())

['male' 'female']
['S' 'C' 'Q']

In [18]:
df['Sex'].value_counts()

Sex
male      577
female    312
Name: count, dtype: int64

In [19]:
# Count of survivors and non-survivors
df['Survived'].value_counts()

Survived
0    549
1    340
Name: count, dtype: int64

In [20]:
# Survival rate by gender
df.groupby('Sex')['Survived'].mean()

Sex
female    0.740385
male      0.188908
Name: Survived, dtype: float64

## ðŸ“Š Step 5: Correlations & Grouping

In [21]:
# Basic correlation matrix
df.corr(numeric_only=True)

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
PassengerId,1.000000,-0.005028,-0.035330,0.031319,-0.057686,-0.001657,0.012703
Survived,-0.005028,1.000000,-0.335549,-0.069822,-0.034040,0.083151,0.255290
Pclass,-0.035330,-0.335549,1.000000,-0.336512,0.081656,0.016824,-0.548193
Age,0.031319,-0.069822,-0.336512,1.000000,-0.232543,-0.171485,0.093707
SibSp,-0.057686,-0.034040,0.081656,-0.232543,1.000000,0.414542,0.160887
Parch,-0.001657,0.083151,0.016824,-0.171485,0.414542,1.000000,0.217532
Fare,0.012703,0.255290,-0.548193,0.093707,0.160887,0.217532,1.000000

In [22]:
# correlation with target variable
df.corr(numeric_only=True)['Survived'].sort_values(ascending=False)

Survived       1.000000
Fare           0.255290
Parch          0.083151
PassengerId   -0.005028
SibSp         -0.034040
Age           -0.069822
Pclass        -0.335549
Name: Survived, dtype: float64

In [23]:
# Average age by class
df.groupby('Pclass')['Age'].mean()

Pclass
1    36.688879
2    29.765380
3    25.932627
Name: Age, dtype: float64

In [24]:
# Survival rate by Passenger Class
df.groupby('Pclass')['Survived'].mean()

Pclass
1    0.626168
2    0.472826
3    0.242363
Name: Survived, dtype: float64

In [25]:
#Passenger count by Embarked Port
df.groupby('Embarked').size()

Embarked
C    168
Q     77
S    644
dtype: int64

In [26]:
# Age statistics by survival status
df.groupby('Survived')['Age'].agg(['mean', 'median', 'min', 'max'])

               mean  median   min   max
Survived
0         30.028233    28.0  1.00  74.0
1         28.163735    28.0  0.42  80.0

## âœ… Summary
- Loaded and inspected the Titanic dataset
- Cleaned missing values in 'Age' and 'Embarked'
- Explored survival rate by different features
- Performed basic grouping and correlation analysis